blake-mh-liu/ADCU_TC387/tresos/plugins/Os_TS_T16D27M6I1R0/include/TRICORE/Os_tc38x.h
/* Os_tc38x.h - Description of Tricore (AURIX) variant TC38X
 *
 * Description of common properties of all Aurix TC38X derivatives.
 *
 * Copyright Elektrobit Automotive GmbH
 * All rights exclusively reserved for Elektrobit Automotive GmbH,
 * unless expressly agreed to otherwise.
*/
#ifndef OS_TC38X_H
#define OS_TC38X_H

/* Start adress of physical address space */
#define OS_PHYS_ADDR_SPACE_START	OS_U(0x10000000)

/* Base addresses for the memory mapped CSFRs needed for StartCore()
 * 
 * Core 0: F881 0000
 * Core 1: F883 0000
 * Core 2: F885 0000
 * Core 3: F887 0000
 *
 * */
#define OS_CPUCSFR(coreid) \
	(((coreid) < OS_U(5)) ? (OS_U(0xF8810000) + ((coreid) * OS_U(0x20000))) : OS_U(0xF88D0000))

/* Core-specific physical memory attributes for data(PMA0)/instruction(PMA1) cache enabled/disabled
 *
 * The TC1.6.2 cores have true caches, which we cannot use for writeable memories since there is
 * no way to achieve cache coherency (in an atomic fashion).
 *
 * PMA values:
 * Segment:  fedc ba98 7654 3210
 *           0000 0011 0000 0000 - 0x0300 - cached access on segments which are cached by default.
 */
#define OS_PMA0_CACHEENABLED(coreid)	OS_U(0x0300)
#define OS_PMA0_CACHEDISABLED(coreid)	OS_U(0x0300)
#define OS_PMA1_CACHEENABLED(coreid)	OS_PMA0_CACHEENABLED(coreid)
#define OS_PMA1_CACHEDISABLED(coreid)	OS_U(0x0300)
#define PCON0_CACHE_BYPASS				OS_U(0x2)
#define DCON0_CACHE_BYPASS				OS_U(0x2)

/* Memory protection registers don't have lower 3 bits in Aurix
*/
#define OS_DPRX_GRANULARITY_BITS	OS_U(3)

/* SRC registers according to AURIX TC38x Target Specification V2.3.0.
*/

#define OS_SRCBASE					OS_U(0xf0038000)

#define OS_SRC_CPU0SB				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0000u))
#define OS_SRC_CPU1SB				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0004u))
#define OS_SRC_CPU2SB				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0008u))
#define OS_SRC_CPU3SB				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x000Cu))
/* 0x0010 to 0x001C are undocumented. */
#define OS_SRC_BCUSPB				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0020u))
/* 0x0024 to 0x002C are undocumented. */
#define OS_SRC_XBAR0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0030u))
/* 0x0034 to 0x003C are undocumented. */
#define OS_SRC_CERBERUS0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0040u))
#define OS_SRC_CERBERUS1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0044u))
/* 0x0048 to 0x004C are undocumented. */
#define OS_SRC_ASCLIN0TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0050u))
#define OS_SRC_ASCLIN0RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0054u))
#define OS_SRC_ASCLIN0ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0058u))
#define OS_SRC_ASCLIN1TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x005Cu))
#define OS_SRC_ASCLIN1RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0060u))
#define OS_SRC_ASCLIN1ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0064u))
#define OS_SRC_ASCLIN2TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0068u))
#define OS_SRC_ASCLIN2RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x006Cu))
#define OS_SRC_ASCLIN2ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0070u))
#define OS_SRC_ASCLIN3TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0074u))
#define OS_SRC_ASCLIN3RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0078u))
#define OS_SRC_ASCLIN3ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x007Cu))
#define OS_SRC_ASCLIN4TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0080u))
#define OS_SRC_ASCLIN4RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0084u))
#define OS_SRC_ASCLIN4ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0088u))
#define OS_SRC_ASCLIN5TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x008Cu))
#define OS_SRC_ASCLIN5RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0090u))
#define OS_SRC_ASCLIN5ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0094u))
#define OS_SRC_ASCLIN6TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0098u))
#define OS_SRC_ASCLIN6RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x009Cu))
#define OS_SRC_ASCLIN6ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00A0u))
#define OS_SRC_ASCLIN7TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00A4u))
#define OS_SRC_ASCLIN7RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00A8u))
#define OS_SRC_ASCLIN7ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00ACu))
#define OS_SRC_ASCLIN8TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00B0u))
#define OS_SRC_ASCLIN8RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00B4u))
#define OS_SRC_ASCLIN8ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00B8u))
#define OS_SRC_ASCLIN9TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00BCu))
#define OS_SRC_ASCLIN9RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00C0u))
#define OS_SRC_ASCLIN9ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00C4u))
#define OS_SRC_ASCLIN10TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00C8u))
#define OS_SRC_ASCLIN10RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00CCu))
#define OS_SRC_ASCLIN10ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00D0u))
#define OS_SRC_ASCLIN11TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00D4u))
#define OS_SRC_ASCLIN11RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00D8u))
#define OS_SRC_ASCLIN11ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00DCu))
/* 0x00E0 to 0x00E8 are undocumented. */
#define OS_SRC_MTUDONE				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00ECu))
#define OS_SRC_QSPI0TX				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00F0u))
#define OS_SRC_QSPI0RX				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00F4u))
#define OS_SRC_QSPI0ERR				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00F8u))
#define OS_SRC_QSPI0PT				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x00FCu))
#define OS_SRC_QSPI0U				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0100u))
#define OS_SRC_QSPI1TX				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0104u))
#define OS_SRC_QSPI1RX				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0108u))
#define OS_SRC_QSPI1ERR				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x010Cu))
#define OS_SRC_QSPI1PT				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0110u))
#define OS_SRC_QSPI1U				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0114u))
#define OS_SRC_QSPI2TX				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0118u))
#define OS_SRC_QSPI2RX				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x011Cu))
#define OS_SRC_QSPI2ERR				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0120u))
#define OS_SRC_QSPI2PT				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0124u))
#define OS_SRC_QSPI2U				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0128u))
#define OS_SRC_QSPI3TX				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x012Cu))
#define OS_SRC_QSPI3RX				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0130u))
#define OS_SRC_QSPI3ERR				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0134u))
#define OS_SRC_QSPI3PT				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0138u))
#define OS_SRC_QSPI3U				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x013Cu))
#define OS_SRC_QSPI4TX				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0140u))
#define OS_SRC_QSPI4RX				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0144u))
#define OS_SRC_QSPI4ERR				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0148u))
#define OS_SRC_QSPI4PT				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x014Cu))
#define OS_SRC_QSPI4U				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0150u))
/* 0x0154 to 0x017C are undocumented. */
#define OS_SRC_HSCT0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0180u))
/* 0x0184 to 0x018C are undocumented. */
#define OS_SRC_HSSL0COK0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0190u))
#define OS_SRC_HSSL0RDI0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0194u))
#define OS_SRC_HSSL0ERR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0198u))
#define OS_SRC_HSSL0TRG0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x019Cu))
#define OS_SRC_HSSL0COK1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01A0u))
#define OS_SRC_HSSL0RDI1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01A4u))
#define OS_SRC_HSSL0ERR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01A8u))
#define OS_SRC_HSSL0TRG1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01ACu))
#define OS_SRC_HSSL0COK2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01B0u))
#define OS_SRC_HSSL0RDI2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01B4u))
#define OS_SRC_HSSL0ERR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01B8u))
#define OS_SRC_HSSL0TRG2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01BCu))
#define OS_SRC_HSSL0COK3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01C0u))
#define OS_SRC_HSSL0RDI3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01C4u))
#define OS_SRC_HSSL0ERR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01C8u))
#define OS_SRC_HSSL0TRG3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01CCu))
#define OS_SRC_HSSL0EXI				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01D0u))
#define OS_SRC_CAN3INT0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01D4u))
#define OS_SRC_CAN3INT1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01D8u))
#define OS_SRC_CAN3INT2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01DCu))
#define OS_SRC_CAN3INT3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01E0u))
#define OS_SRC_CAN3INT4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01E4u))
#define OS_SRC_CAN3INT5				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01E8u))
#define OS_SRC_CAN3INT6				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01ECu))
#define OS_SRC_CAN3INT7				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01F0u))
#define OS_SRC_CAN3INT8				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01F4u))
#define OS_SRC_CAN3INT9				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01F8u))
#define OS_SRC_CAN3INT10			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x01FCu))
#define OS_SRC_CAN3INT11			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0200u))
#define OS_SRC_CAN3INT12			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0204u))
#define OS_SRC_CAN3INT13			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0208u))
#define OS_SRC_CAN3INT14			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x020Cu))
#define OS_SRC_CAN3INT15			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0210u))
/* 0x0214 to 0x021C are undocumented. */
#define OS_SRC_I2C0DTR				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0220u))
#define OS_SRC_I2C0ERR				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0224u))
#define OS_SRC_I2C0P				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0228u))
/* 0x022C is undocumented. */
#define OS_SRC_I2C1DTR				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0230u))
#define OS_SRC_I2C1ERR				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0234u))
#define OS_SRC_I2C1P				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0238u))
/* 0x023C is undocumented. */
#define OS_SRC_SENT0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0240u))
#define OS_SRC_SENT1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0244u))
#define OS_SRC_SENT2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0248u))
#define OS_SRC_SENT3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x024Cu))
#define OS_SRC_SENT4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0250u))
#define OS_SRC_SENT5				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0254u))
#define OS_SRC_SENT6				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0258u))
#define OS_SRC_SENT7				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x025Cu))
#define OS_SRC_SENT8				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0260u))
#define OS_SRC_SENT9				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0264u))
/* 0x0268 to 0x026C are undocumented. */
#define OS_SRC_MSC0SR0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0270u))
#define OS_SRC_MSC0SR1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0274u))
#define OS_SRC_MSC0SR2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0278u))
#define OS_SRC_MSC0SR3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x027Cu))
#define OS_SRC_MSC0SR4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0280u))
#define OS_SRC_MSC1SR0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0284u))
#define OS_SRC_MSC1SR1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0288u))
#define OS_SRC_MSC1SR2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x028Cu))
#define OS_SRC_MSC1SR3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0290u))
#define OS_SRC_MSC1SR4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0294u))
#define OS_SRC_MSC2SR0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0298u))
#define OS_SRC_MSC2SR1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x029Cu))
#define OS_SRC_MSC2SR2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02A0u))
#define OS_SRC_MSC2SR3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02A4u))
#define OS_SRC_MSC2SR4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02A8u))
/* 0x02AC to 0x02BC are undocumented. */
#define OS_SRC_CCU60SR0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02C0u))
#define OS_SRC_CCU60SR1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02C4u))
#define OS_SRC_CCU60SR2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02C8u))
#define OS_SRC_CCU60SR3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02CCu))
#define OS_SRC_CCU61SR0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02D0u))
#define OS_SRC_CCU61SR1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02D4u))
#define OS_SRC_CCU61SR2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02D8u))
#define OS_SRC_CCU61SR3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02DCu))
#define OS_SRC_GPT120CIRQ			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02E0u))
#define OS_SRC_GPT120T2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02E4u))
#define OS_SRC_GPT120T3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02E8u))
#define OS_SRC_GPT120T4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02ECu))
#define OS_SRC_GPT120T5				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02F0u))
#define OS_SRC_GPT120T6				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x02F4u))
/* 0x02F8 to 0x02FC are undocumented. */
#define OS_SRC_STM0SR0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0300u))
#define OS_SRC_STM0SR1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0304u))
#define OS_SRC_STM1SR0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0308u))
#define OS_SRC_STM1SR1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x030Cu))
#define OS_SRC_STM2SR0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0310u))
#define OS_SRC_STM2SR1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0314u))
#define OS_SRC_STM3SR0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0318u))
#define OS_SRC_STM3SR1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x031Cu))
/* 0x0320 to 0x032C are undocumented. */
#define OS_SRC_FCE0					(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0330u))
/* 0x0334 to 0x033C are undocumented. */
#define OS_SRC_DMAERR0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0340u))
#define OS_SRC_DMAERR1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0344u))
#define OS_SRC_DMAERR2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0348u))
#define OS_SRC_DMAERR3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x034Cu))
/* 0x0350 to 0x036C are undocumented. */
#define OS_SRC_DMACH0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0370u))
#define OS_SRC_DMACH1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0374u))
#define OS_SRC_DMACH2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0378u))
#define OS_SRC_DMACH3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x037Cu))
#define OS_SRC_DMACH4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0380u))
#define OS_SRC_DMACH5				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0384u))
#define OS_SRC_DMACH6				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0388u))
#define OS_SRC_DMACH7				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x038Cu))
#define OS_SRC_DMACH8				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0390u))
#define OS_SRC_DMACH9				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0394u))
#define OS_SRC_DMACH10				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0398u))
#define OS_SRC_DMACH11				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x039Cu))
#define OS_SRC_DMACH12				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03A0u))
#define OS_SRC_DMACH13				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03A4u))
#define OS_SRC_DMACH14				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03A8u))
#define OS_SRC_DMACH15				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03ACu))
#define OS_SRC_DMACH16				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03B0u))
#define OS_SRC_DMACH17				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03B4u))
#define OS_SRC_DMACH18				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03B8u))
#define OS_SRC_DMACH19				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03BCu))
#define OS_SRC_DMACH20				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03C0u))
#define OS_SRC_DMACH21				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03C4u))
#define OS_SRC_DMACH22				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03C8u))
#define OS_SRC_DMACH23				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03CCu))
#define OS_SRC_DMACH24				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03D0u))
#define OS_SRC_DMACH25				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03D4u))
#define OS_SRC_DMACH26				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03D8u))
#define OS_SRC_DMACH27				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03DCu))
#define OS_SRC_DMACH28				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03E0u))
#define OS_SRC_DMACH29				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03E4u))
#define OS_SRC_DMACH30				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03E8u))
#define OS_SRC_DMACH31				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03ECu))
#define OS_SRC_DMACH32				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03F0u))
#define OS_SRC_DMACH33				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03F4u))
#define OS_SRC_DMACH34				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03F8u))
#define OS_SRC_DMACH35				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x03FCu))
#define OS_SRC_DMACH36				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0400u))
#define OS_SRC_DMACH37				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0404u))
#define OS_SRC_DMACH38				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0408u))
#define OS_SRC_DMACH39				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x040Cu))
#define OS_SRC_DMACH40				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0410u))
#define OS_SRC_DMACH41				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0414u))
#define OS_SRC_DMACH42				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0418u))
#define OS_SRC_DMACH43				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x041Cu))
#define OS_SRC_DMACH44				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0420u))
#define OS_SRC_DMACH45				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0424u))
#define OS_SRC_DMACH46				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0428u))
#define OS_SRC_DMACH47				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x042Cu))
#define OS_SRC_DMACH48				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0430u))
#define OS_SRC_DMACH49				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0434u))
#define OS_SRC_DMACH50				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0438u))
#define OS_SRC_DMACH51				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x043Cu))
#define OS_SRC_DMACH52				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0440u))
#define OS_SRC_DMACH53				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0444u))
#define OS_SRC_DMACH54				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0448u))
#define OS_SRC_DMACH55				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x044Cu))
#define OS_SRC_DMACH56				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0450u))
#define OS_SRC_DMACH57				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0454u))
#define OS_SRC_DMACH58				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0458u))
#define OS_SRC_DMACH59				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x045Cu))
#define OS_SRC_DMACH60				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0460u))
#define OS_SRC_DMACH61				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0464u))
#define OS_SRC_DMACH62				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0468u))
#define OS_SRC_DMACH63				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x046Cu))
#define OS_SRC_DMACH64				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0470u))
#define OS_SRC_DMACH65				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0474u))
#define OS_SRC_DMACH66				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0478u))
#define OS_SRC_DMACH67				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x047Cu))
#define OS_SRC_DMACH68				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0480u))
#define OS_SRC_DMACH69				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0484u))
#define OS_SRC_DMACH70				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0488u))
#define OS_SRC_DMACH71				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x048Cu))
#define OS_SRC_DMACH72				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0490u))
#define OS_SRC_DMACH73				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0494u))
#define OS_SRC_DMACH74				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0498u))
#define OS_SRC_DMACH75				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x049Cu))
#define OS_SRC_DMACH76				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04A0u))
#define OS_SRC_DMACH77				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04A4u))
#define OS_SRC_DMACH78				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04A8u))
#define OS_SRC_DMACH79				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04ACu))
#define OS_SRC_DMACH80				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04B0u))
#define OS_SRC_DMACH81				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04B4u))
#define OS_SRC_DMACH82				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04B8u))
#define OS_SRC_DMACH83				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04BCu))
#define OS_SRC_DMACH84				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04C0u))
#define OS_SRC_DMACH85				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04C4u))
#define OS_SRC_DMACH86				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04C8u))
#define OS_SRC_DMACH87				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04CCu))
#define OS_SRC_DMACH88				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04D0u))
#define OS_SRC_DMACH89				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04D4u))
#define OS_SRC_DMACH90				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04D8u))
#define OS_SRC_DMACH91				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04DCu))
#define OS_SRC_DMACH92				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04E0u))
#define OS_SRC_DMACH93				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04E4u))
#define OS_SRC_DMACH94				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04E8u))
#define OS_SRC_DMACH95				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04ECu))
#define OS_SRC_DMACH96				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04F0u))
#define OS_SRC_DMACH97				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04F4u))
#define OS_SRC_DMACH98				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04F8u))
#define OS_SRC_DMACH99				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x04FCu))
#define OS_SRC_DMACH100				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0500u))
#define OS_SRC_DMACH101				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0504u))
#define OS_SRC_DMACH102				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0508u))
#define OS_SRC_DMACH103				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x050Cu))
#define OS_SRC_DMACH104				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0510u))
#define OS_SRC_DMACH105				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0514u))
#define OS_SRC_DMACH106				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0518u))
#define OS_SRC_DMACH107				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x051Cu))
#define OS_SRC_DMACH108				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0520u))
#define OS_SRC_DMACH109				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0524u))
#define OS_SRC_DMACH110				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0528u))
#define OS_SRC_DMACH111				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x052Cu))
#define OS_SRC_DMACH112				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0530u))
#define OS_SRC_DMACH113				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0534u))
#define OS_SRC_DMACH114				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0538u))
#define OS_SRC_DMACH115				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x053Cu))
#define OS_SRC_DMACH116				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0540u))
#define OS_SRC_DMACH117				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0544u))
#define OS_SRC_DMACH118				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0548u))
#define OS_SRC_DMACH119				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x054Cu))
#define OS_SRC_DMACH120				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0550u))
#define OS_SRC_DMACH121				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0554u))
#define OS_SRC_DMACH122				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0558u))
#define OS_SRC_DMACH123				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x055Cu))
#define OS_SRC_DMACH124				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0560u))
#define OS_SRC_DMACH125				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0564u))
#define OS_SRC_DMACH126				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0568u))
#define OS_SRC_DMACH127				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x056Cu))
#define OS_SRC_SDMMCERR 			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0570u))
#define OS_SRC_SDMMCDMA 			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0574u))
/* 0x0578 to 0x057C are undocumented. */
#define OS_SRC_GETH0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0580u))
#define OS_SRC_GETH1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0584u))
#define OS_SRC_GETH2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0588u))
#define OS_SRC_GETH3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x058Cu))
#define OS_SRC_GETH4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0590u))
#define OS_SRC_GETH5				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0594u))
#define OS_SRC_GETH6				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0598u))
#define OS_SRC_GETH7				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x059Cu))
