blake-mh-liu/ADCU_TC387/tresos/plugins/Os_TS_T16D27M6I1R0/include/TRICORE/Os_tc38x.h
#define OS_SRC_GETH8				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05A0u))
#define OS_SRC_GETH9				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05A4u))
/* 0x05A8 to 0x05AC are undocumented. */
#define OS_SRC_CAN0INT0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05B0u))
#define OS_SRC_CAN0INT1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05B4u))
#define OS_SRC_CAN0INT2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05B8u))
#define OS_SRC_CAN0INT3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05BCu))
#define OS_SRC_CAN0INT4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05C0u))
#define OS_SRC_CAN0INT5				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05C4u))
#define OS_SRC_CAN0INT6				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05C8u))
#define OS_SRC_CAN0INT7				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05CCu))
#define OS_SRC_CAN0INT8				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05D0u))
#define OS_SRC_CAN0INT9				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05D4u))
#define OS_SRC_CAN0INT10			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05D8u))
#define OS_SRC_CAN0INT11			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05DCu))
#define OS_SRC_CAN0INT12			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05E0u))
#define OS_SRC_CAN0INT13			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05E4u))
#define OS_SRC_CAN0INT14			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05E8u))
#define OS_SRC_CAN0INT15			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05ECu))
#define OS_SRC_CAN1INT0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05F0u))
#define OS_SRC_CAN1INT1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05F4u))
#define OS_SRC_CAN1INT2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05F8u))
#define OS_SRC_CAN1INT3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x05FCu))
#define OS_SRC_CAN1INT4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0600u))
#define OS_SRC_CAN1INT5				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0604u))
#define OS_SRC_CAN1INT6				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0608u))
#define OS_SRC_CAN1INT7				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x060Cu))
#define OS_SRC_CAN1INT8				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0610u))
#define OS_SRC_CAN1INT9				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0614u))
#define OS_SRC_CAN1INT10			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0618u))
#define OS_SRC_CAN1INT11			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x061Cu))
#define OS_SRC_CAN1INT12			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0620u))
#define OS_SRC_CAN1INT13			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0624u))
#define OS_SRC_CAN1INT14			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0628u))
#define OS_SRC_CAN1INT15			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x062Cu))
#define OS_SRC_CAN2INT0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0630u))
#define OS_SRC_CAN2INT1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0634u))
#define OS_SRC_CAN2INT2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0638u))
#define OS_SRC_CAN2INT3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x063Cu))
#define OS_SRC_CAN2INT4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0640u))
#define OS_SRC_CAN2INT5				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0644u))
#define OS_SRC_CAN2INT6				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0648u))
#define OS_SRC_CAN2INT7				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x064Cu))
#define OS_SRC_CAN2INT8				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0650u))
#define OS_SRC_CAN2INT9				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0654u))
#define OS_SRC_CAN2INT10			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0658u))
#define OS_SRC_CAN2INT11			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x065Cu))
#define OS_SRC_CAN2INT12			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0660u))
#define OS_SRC_CAN2INT13			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0664u))
#define OS_SRC_CAN2INT14			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0668u))
#define OS_SRC_CAN2INT15			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x066Cu))
#define OS_SRC_VADCG0SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0670u))
#define OS_SRC_VADCG0SR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0674u))
#define OS_SRC_VADCG0SR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0678u))
#define OS_SRC_VADCG0SR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x067Cu))
#define OS_SRC_VADCG1SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0680u))
#define OS_SRC_VADCG1SR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0684u))
#define OS_SRC_VADCG1SR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0688u))
#define OS_SRC_VADCG1SR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x068Cu))
#define OS_SRC_VADCG2SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0690u))
#define OS_SRC_VADCG2SR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0694u))
#define OS_SRC_VADCG2SR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0698u))
#define OS_SRC_VADCG2SR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x069Cu))
#define OS_SRC_VADCG3SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06A0u))
#define OS_SRC_VADCG3SR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06A4u))
#define OS_SRC_VADCG3SR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06A8u))
#define OS_SRC_VADCG3SR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06ACu))
#define OS_SRC_VADCG4SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06B0u))
#define OS_SRC_VADCG4SR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06B4u))
#define OS_SRC_VADCG4SR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06B8u))
#define OS_SRC_VADCG4SR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06BCu))
#define OS_SRC_VADCG5SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06C0u))
#define OS_SRC_VADCG5SR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06C4u))
#define OS_SRC_VADCG5SR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06C8u))
#define OS_SRC_VADCG5SR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06CCu))
#define OS_SRC_VADCG6SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06D0u))
#define OS_SRC_VADCG6SR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06D4u))
#define OS_SRC_VADCG6SR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06D8u))
#define OS_SRC_VADCG6SR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06DCu))
#define OS_SRC_VADCG7SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06E0u))
#define OS_SRC_VADCG7SR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06E4u))
#define OS_SRC_VADCG7SR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06E8u))
#define OS_SRC_VADCG7SR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06ECu))
#define OS_SRC_VADCG8SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06F0u))
#define OS_SRC_VADCG8SR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06F4u))
#define OS_SRC_VADCG8SR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06F8u))
#define OS_SRC_VADCG8SR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x06FCu))
#define OS_SRC_VADCG9SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0700u))
#define OS_SRC_VADCG9SR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0704u))
#define OS_SRC_VADCG9SR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0708u))
#define OS_SRC_VADCG9SR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x070Cu))
#define OS_SRC_VADCG10SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0710u))
#define OS_SRC_VADCG10SR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0714u))
#define OS_SRC_VADCG10SR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0718u))
#define OS_SRC_VADCG10SR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x071Cu))
#define OS_SRC_VADCG11SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0720u))
#define OS_SRC_VADCG11SR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0724u))
#define OS_SRC_VADCG11SR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0728u))
#define OS_SRC_VADCG11SR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x072Cu))
#define OS_SRC_VADCFC0SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0730u))
#define OS_SRC_VADCFC1SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0734u))
#define OS_SRC_VADCFC2SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0738u))
#define OS_SRC_VADCFC3SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x073Cu))
/* 0x0740 to 0x074C are undocumented. */
#define OS_SRC_VADCCG0SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0750u))
#define OS_SRC_VADCCG0SR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0754u))
#define OS_SRC_VADCCG0SR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0758u))
#define OS_SRC_VADCCG0SR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x075Cu))
#define OS_SRC_VADCCG1SR0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0760u))
#define OS_SRC_VADCCG1SR1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0764u))
#define OS_SRC_VADCCG1SR2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0768u))
#define OS_SRC_VADCCG1SR3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x076Cu))
#define OS_SRC_DSADCSRM0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0770u))
#define OS_SRC_DSADCSRA0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0774u))
#define OS_SRC_DSADCSRM1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0778u))
#define OS_SRC_DSADCSRA1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x077Cu))
#define OS_SRC_DSADCSRM2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0780u))
#define OS_SRC_DSADCSRA2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0784u))
#define OS_SRC_DSADCSRM3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0788u))
#define OS_SRC_DSADCSRA3			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x078Cu))
#define OS_SRC_DSADCSRM4			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0790u))
#define OS_SRC_DSADCSRA4			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0794u))
#define OS_SRC_DSADCSRM5			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0798u))
#define OS_SRC_DSADCSRA5			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x079Cu))
#define OS_SRC_DSADCSRM6			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x07A0u))
#define OS_SRC_DSADCSRA6			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x07A4u))
#define OS_SRC_DSADCSRM7			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x07A8u))
#define OS_SRC_DSADCSRA7			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x07ACu))
#define OS_SRC_DSADCSRM8			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x07B0u))
#define OS_SRC_DSADCSRA8			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x07B4u))
#define OS_SRC_DSADCSRM9			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x07B8u))
#define OS_SRC_DSADCSRA9			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x07BCu))
/* 0x07C0 to 0x07DC are undocumented. */
#define OS_SRC_ASCLIN12TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x07E0u))
#define OS_SRC_ASCLIN12RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x07E4u))
#define OS_SRC_ASCLIN12ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x07E8u))
#define OS_SRC_ASCLIN13TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x07ECu))
#define OS_SRC_ASCLIN13RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x07F0u))
#define OS_SRC_ASCLIN13ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x07F4u))
/* 0x07F8 to 0x07FC are undocumented. */
#define OS_SRC_ERAY0INT0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0800u))
#define OS_SRC_ERAY0INT1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0804u))
#define OS_SRC_ERAY0TINT0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0808u))
#define OS_SRC_ERAY0TINT1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x080Cu))
#define OS_SRC_ERAY0NDAT0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0810u))
#define OS_SRC_ERAY0NDAT1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0814u))
#define OS_SRC_ERAY0MBSC0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0818u))
#define OS_SRC_ERAY0MBSC1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x081Cu))
#define OS_SRC_ERAY0OBUSY			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0820u))
#define OS_SRC_ERAY0IBUSY			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0824u))
/* 0x0828 to 0x082C are undocumented. */
#define OS_SRC_ERAY1INT0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0830u))
#define OS_SRC_ERAY1INT1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0834u))
#define OS_SRC_ERAY1TINT0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0838u))
#define OS_SRC_ERAY1TINT1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x083Cu))
#define OS_SRC_ERAY1NDAT0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0840u))
#define OS_SRC_ERAY1NDAT1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0844u))
#define OS_SRC_ERAY1MBSC0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0848u))
#define OS_SRC_ERAY1MBSC1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x084Cu))
#define OS_SRC_ERAY1OBUSY			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0850u))
#define OS_SRC_ERAY1IBUSY			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0854u))
/* 0x0858 to 0x085C are undocumented. */
#define OS_SRC_DMUHOST				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0860u))
#define OS_SRC_DMUFSI				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0864u))
/* 0x0868 to 0x086C are undocumented. */
#define OS_SRC_HSM0					(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0870u))
#define OS_SRC_HSM1					(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0874u))
/* 0x0878 to 0x087C are undocumented. */
#define OS_SRC_SCUERU0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0880u))
#define OS_SRC_SCUERU1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0884u))
#define OS_SRC_SCUERU2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0888u))
#define OS_SRC_SCUERU3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x088Cu))
/* 0x0890 to 0x08A8 are undocumented. */
#define OS_SRC_PMSDTS				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08ACu))
#define OS_SRC_PMS0					(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08B0u))
#define OS_SRC_PMS1					(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08B4u))
#define OS_SRC_PMS2					(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08B8u))
#define OS_SRC_PMS3					(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08BCu))
#define OS_SRC_SCR					(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08C0u))
/* 0x08C4 to 0x08CC are undocumented. */
#define OS_SRC_SMU0					(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08D0u))
#define OS_SRC_SMU1					(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08D4u))
#define OS_SRC_SMU2					(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08D8u))
/* 0x08DC is undocumented. */
#define OS_SRC_PSI50				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08E0u))
#define OS_SRC_PSI51				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08E4u))
#define OS_SRC_PSI52				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08E8u))
#define OS_SRC_PSI53				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08ECu))
#define OS_SRC_PSI54				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08F0u))
#define OS_SRC_PSI55				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08F4u))
#define OS_SRC_PSI56				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08F8u))
#define OS_SRC_PSI57				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x08FCu))
/* 0x0900 to 0x090C are undocumented. */
#define OS_SRC_DAM0LI0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0910u))
#define OS_SRC_DAM0RI0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0914u))
#define OS_SRC_DAM0LI1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0918u))
#define OS_SRC_DAM0RI1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x091Cu))
#define OS_SRC_DAM0DR				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0920u))
#define OS_SRC_DAM0ERR				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0924u))
/* 0x0928 to 0x094C are undocumented. */
#define OS_SRC_PSI5S0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0950u))
#define OS_SRC_PSI5S1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0954u))
#define OS_SRC_PSI5S2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0958u))
#define OS_SRC_PSI5S3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x095Cu))
#define OS_SRC_PSI5S4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0960u))
#define OS_SRC_PSI5S5				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0964u))
#define OS_SRC_PSI5S6				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0968u))
#define OS_SRC_PSI5S7				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x096Cu))
/* 0x0970 to 0x098C are undocumented. */
#define OS_SRC_GPSR00				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0990u))
#define OS_SRC_GPSR01				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0994u))
#define OS_SRC_GPSR02				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0998u))
#define OS_SRC_GPSR03				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x099Cu))
#define OS_SRC_GPSR04				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09A0u))
#define OS_SRC_GPSR05				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09A4u))
#define OS_SRC_GPSR06				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09A8u))
#define OS_SRC_GPSR07				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09ACu))
#define OS_SRC_GPSR10				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09B0u))
#define OS_SRC_GPSR11				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09B4u))
#define OS_SRC_GPSR12				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09B8u))
#define OS_SRC_GPSR13				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09BCu))
#define OS_SRC_GPSR14				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09C0u))
#define OS_SRC_GPSR15				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09C4u))
#define OS_SRC_GPSR16				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09C8u))
#define OS_SRC_GPSR17				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09CCu))
#define OS_SRC_GPSR20				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09D0u))
#define OS_SRC_GPSR21				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09D4u))
#define OS_SRC_GPSR22				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09D8u))
#define OS_SRC_GPSR23				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09DCu))
#define OS_SRC_GPSR24				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09E0u))
#define OS_SRC_GPSR25				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09E4u))
#define OS_SRC_GPSR26				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09E8u))
#define OS_SRC_GPSR27				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09ECu))
#define OS_SRC_GPSR30				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09F0u))
#define OS_SRC_GPSR31				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09F4u))
#define OS_SRC_GPSR32				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09F8u))
#define OS_SRC_GPSR33				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x09FCu))
#define OS_SRC_GPSR34				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A00u))
#define OS_SRC_GPSR35				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A04u))
#define OS_SRC_GPSR36				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A08u))
#define OS_SRC_GPSR37				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A0Cu))
/* 0x0A10 to 0x0A4C are undocumented. */
#define OS_SRC_ASCLIN14TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A50u))
#define OS_SRC_ASCLIN14RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A54u))
#define OS_SRC_ASCLIN14ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A58u))
#define OS_SRC_ASCLIN15TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A5Cu))
#define OS_SRC_ASCLIN15RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A60u))
#define OS_SRC_ASCLIN15ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A64u))
/* 0x0A68 to 0x0A6C are undocumented. */
#define OS_SRC_GTMAEIIRQ			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A70u))
#define OS_SRC_GTMARUIRQ0			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A74u))
#define OS_SRC_GTMARUIRQ1			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A78u))
#define OS_SRC_GTMARUIRQ2			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A7Cu))
#define OS_SRC_GTMBRCIRQ			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A80u))
#define OS_SRC_GTMCMPIRQ			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A84u))
#define OS_SRC_GTMSPE0IRQ			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A88u))
#define OS_SRC_GTMSPE1IRQ			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A8Cu))
#define OS_SRC_GTMSPE2IRQ			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A90u))
#define OS_SRC_GTMSPE3IRQ			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0A94u))
/* 0x0A98 to 0x0A9C are undocumented. */
#define OS_SRC_GTMPSM00				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0AA0u))
#define OS_SRC_GTMPSM01				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0AA4u))
#define OS_SRC_GTMPSM02				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0AA8u))
#define OS_SRC_GTMPSM03				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0AACu))
#define OS_SRC_GTMPSM04				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0AB0u))
#define OS_SRC_GTMPSM05				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0AB4u))
#define OS_SRC_GTMPSM06				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0AB8u))
#define OS_SRC_GTMPSM07				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0ABCu))
#define OS_SRC_GTMPSM10				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0AC0u))
#define OS_SRC_GTMPSM11				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0AC4u))
#define OS_SRC_GTMPSM12				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0AC8u))
#define OS_SRC_GTMPSM13				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0ACCu))
#define OS_SRC_GTMPSM14				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0AD0u))
#define OS_SRC_GTMPSM15				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0AD4u))
#define OS_SRC_GTMPSM16				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0AD8u))
#define OS_SRC_GTMPSM17				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0ADCu))
/* 0x0AE0 to 0x0AFC are undocumented. */
#define OS_SRC_GTMDPLL0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B00u))
#define OS_SRC_GTMDPLL1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B04u))
#define OS_SRC_GTMDPLL2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B08u))
#define OS_SRC_GTMDPLL3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B0Cu))
#define OS_SRC_GTMDPLL4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B10u))
#define OS_SRC_GTMDPLL5				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B14u))
#define OS_SRC_GTMDPLL6				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B18u))
#define OS_SRC_GTMDPLL7				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B1Cu))
#define OS_SRC_GTMDPLL8				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B20u))
#define OS_SRC_GTMDPLL9				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B24u))
#define OS_SRC_GTMDPLL10			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B28u))
#define OS_SRC_GTMDPLL11			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B2Cu))
#define OS_SRC_GTMDPLL12			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B30u))
#define OS_SRC_GTMDPLL13			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B34u))
#define OS_SRC_GTMDPLL14			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B38u))
#define OS_SRC_GTMDPLL15			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B3Cu))
#define OS_SRC_GTMDPLL16			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B40u))
#define OS_SRC_GTMDPLL17			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B44u))
#define OS_SRC_GTMDPLL18			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B48u))
#define OS_SRC_GTMDPLL19			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B4Cu))
#define OS_SRC_GTMDPLL20			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B50u))
#define OS_SRC_GTMDPLL21			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B54u))
#define OS_SRC_GTMDPLL22			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B58u))
#define OS_SRC_GTMDPLL23			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B5Cu))
#define OS_SRC_GTMDPLL24			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B60u))
#define OS_SRC_GTMDPLL25			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B64u))
#define OS_SRC_GTMDPLL26			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B68u))
/* 0x0B6C is undocumented. */
#define OS_SRC_GTMERR				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B70u))
/* 0x0B74 to 0x0B8C are undocumented. */
#define OS_SRC_GTMTIM00				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B90u))
#define OS_SRC_GTMTIM01				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B94u))
#define OS_SRC_GTMTIM02				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B98u))
#define OS_SRC_GTMTIM03				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0B9Cu))
#define OS_SRC_GTMTIM04				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BA0u))
#define OS_SRC_GTMTIM05				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BA4u))
#define OS_SRC_GTMTIM06				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BA8u))
#define OS_SRC_GTMTIM07				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BACu))
#define OS_SRC_GTMTIM10				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BB0u))
#define OS_SRC_GTMTIM11				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BB4u))
#define OS_SRC_GTMTIM12				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BB8u))
#define OS_SRC_GTMTIM13				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BBCu))
#define OS_SRC_GTMTIM14				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BC0u))
#define OS_SRC_GTMTIM15				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BC4u))
#define OS_SRC_GTMTIM16				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BC8u))
#define OS_SRC_GTMTIM17				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BCCu))
#define OS_SRC_GTMTIM20				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BD0u))
#define OS_SRC_GTMTIM21				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BD4u))
#define OS_SRC_GTMTIM22				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BD8u))
#define OS_SRC_GTMTIM23				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BDCu))
#define OS_SRC_GTMTIM24				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BE0u))
#define OS_SRC_GTMTIM25				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BE4u))
#define OS_SRC_GTMTIM26				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BE8u))
#define OS_SRC_GTMTIM27				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BECu))
#define OS_SRC_GTMTIM30				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BF0u))
#define OS_SRC_GTMTIM31				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BF4u))
#define OS_SRC_GTMTIM32				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BF8u))
#define OS_SRC_GTMTIM33				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0BFCu))
#define OS_SRC_GTMTIM34				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C00u))
#define OS_SRC_GTMTIM35				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C04u))
#define OS_SRC_GTMTIM36				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C08u))
#define OS_SRC_GTMTIM37				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C0Cu))
