blake-mh-liu/ADCU_TC387/tresos/plugins/Os_TS_T16D27M6I1R0/include/TRICORE/Os_tc38x.h
#define OS_SRC_GTMTIM40				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C10u))
#define OS_SRC_GTMTIM41				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C14u))
#define OS_SRC_GTMTIM42				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C18u))
#define OS_SRC_GTMTIM43				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C1Cu))
#define OS_SRC_GTMTIM44				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C20u))
#define OS_SRC_GTMTIM45				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C24u))
#define OS_SRC_GTMTIM46				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C28u))
#define OS_SRC_GTMTIM47				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C2Cu))
#define OS_SRC_GTMTIM50				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C30u))
#define OS_SRC_GTMTIM51				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C34u))
#define OS_SRC_GTMTIM52				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C38u))
#define OS_SRC_GTMTIM53				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C3Cu))
#define OS_SRC_GTMTIM54				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C40u))
#define OS_SRC_GTMTIM55				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C44u))
#define OS_SRC_GTMTIM56				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C48u))
#define OS_SRC_GTMTIM57				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C4Cu))
#define OS_SRC_GTMTIM60				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C50u))
#define OS_SRC_GTMTIM61				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C54u))
#define OS_SRC_GTMTIM62				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C58u))
#define OS_SRC_GTMTIM63				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C5Cu))
#define OS_SRC_GTMTIM64				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C60u))
#define OS_SRC_GTMTIM65				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C64u))
#define OS_SRC_GTMTIM66				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C68u))
#define OS_SRC_GTMTIM67				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C6Cu))
/* 0x0C70 to 0x0C8C are undocumented. */
#define OS_SRC_ASCLIN16TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C90u))
#define OS_SRC_ASCLIN16RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C94u))
#define OS_SRC_ASCLIN16ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C98u))
#define OS_SRC_ASCLIN17TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0C9Cu))
#define OS_SRC_ASCLIN17RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CA0u))
#define OS_SRC_ASCLIN17ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CA4u))
/* 0x0CA8 to 0x0CAC are undocumented. */
#define OS_SRC_GTMMCS00				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CB0u))
#define OS_SRC_GTMMCS01				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CB4u))
#define OS_SRC_GTMMCS02				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CB8u))
#define OS_SRC_GTMMCS03				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CBCu))
#define OS_SRC_GTMMCS04				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CC0u))
#define OS_SRC_GTMMCS05				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CC4u))
#define OS_SRC_GTMMCS06				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CC8u))
#define OS_SRC_GTMMCS07				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CCCu))
#define OS_SRC_GTMMCS10				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CD0u))
#define OS_SRC_GTMMCS11				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CD4u))
#define OS_SRC_GTMMCS12				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CD8u))
#define OS_SRC_GTMMCS13				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CDCu))
#define OS_SRC_GTMMCS14				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CE0u))
#define OS_SRC_GTMMCS15				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CE4u))
#define OS_SRC_GTMMCS16				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CE8u))
#define OS_SRC_GTMMCS17				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CECu))
#define OS_SRC_GTMMCS20				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CF0u))
#define OS_SRC_GTMMCS21				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CF4u))
#define OS_SRC_GTMMCS22				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CF8u))
#define OS_SRC_GTMMCS23				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0CFCu))
#define OS_SRC_GTMMCS24				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D00u))
#define OS_SRC_GTMMCS25				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D04u))
#define OS_SRC_GTMMCS26				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D08u))
#define OS_SRC_GTMMCS27				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D0Cu))
#define OS_SRC_GTMMCS30				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D10u))
#define OS_SRC_GTMMCS31				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D14u))
#define OS_SRC_GTMMCS32				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D18u))
#define OS_SRC_GTMMCS33				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D1Cu))
#define OS_SRC_GTMMCS34				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D20u))
#define OS_SRC_GTMMCS35				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D24u))
#define OS_SRC_GTMMCS36				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D28u))
#define OS_SRC_GTMMCS37				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D2Cu))
#define OS_SRC_GTMMCS40				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D30u))
#define OS_SRC_GTMMCS41				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D34u))
#define OS_SRC_GTMMCS42				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D38u))
#define OS_SRC_GTMMCS43				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D3Cu))
#define OS_SRC_GTMMCS44				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D40u))
#define OS_SRC_GTMMCS45				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D44u))
#define OS_SRC_GTMMCS46				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D48u))
#define OS_SRC_GTMMCS47				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D4Cu))
#define OS_SRC_GTMMCS50				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D50u))
#define OS_SRC_GTMMCS51				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D54u))
#define OS_SRC_GTMMCS52				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D58u))
#define OS_SRC_GTMMCS53				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D5Cu))
#define OS_SRC_GTMMCS54				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D60u))
#define OS_SRC_GTMMCS55				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D64u))
#define OS_SRC_GTMMCS56				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D68u))
#define OS_SRC_GTMMCS57				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D6Cu))
#define OS_SRC_GTMMCS60				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D70u))
#define OS_SRC_GTMMCS61				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D74u))
#define OS_SRC_GTMMCS62				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D78u))
#define OS_SRC_GTMMCS63				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D7Cu))
#define OS_SRC_GTMMCS64				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D80u))
#define OS_SRC_GTMMCS65				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D84u))
#define OS_SRC_GTMMCS66				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D88u))
#define OS_SRC_GTMMCS67				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0D8Cu))
/* 0x0D90 to 0x0DAC are undocumented. */
#define OS_SRC_CAN4INT0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DB0u))
#define OS_SRC_CAN4INT1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DB4u))
#define OS_SRC_CAN4INT2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DB8u))
#define OS_SRC_CAN4INT3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DBCu))
#define OS_SRC_CAN4INT4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DC0u))
#define OS_SRC_CAN4INT5				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DC4u))
#define OS_SRC_CAN4INT6				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DC8u))
#define OS_SRC_CAN4INT7				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DCCu))
#define OS_SRC_CAN4INT8				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DD0u))
#define OS_SRC_CAN4INT9				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DD4u))
#define OS_SRC_CAN4INT10			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DD8u))
#define OS_SRC_CAN4INT11			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DDCu))
#define OS_SRC_CAN4INT12			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DE0u))
#define OS_SRC_CAN4INT13			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DE4u))
#define OS_SRC_CAN4INT14			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DE8u))
#define OS_SRC_CAN4INT15			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DECu))
#define OS_SRC_ASCLIN18TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DF0u))
#define OS_SRC_ASCLIN18RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DF4u))
#define OS_SRC_ASCLIN18ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DF8u))
#define OS_SRC_ASCLIN19TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0DFCu))
#define OS_SRC_ASCLIN19RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E00u))
#define OS_SRC_ASCLIN19ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E04u))
/* 0x0E08 to 0x0E0C are undocumented. */
#define OS_SRC_GTMTOM00				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E10u))
#define OS_SRC_GTMTOM01				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E14u))
#define OS_SRC_GTMTOM02				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E18u))
#define OS_SRC_GTMTOM03				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E1Cu))
#define OS_SRC_GTMTOM04				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E20u))
#define OS_SRC_GTMTOM05				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E24u))
#define OS_SRC_GTMTOM06				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E28u))
#define OS_SRC_GTMTOM07				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E2Cu))
#define OS_SRC_GTMTOM10				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E30u))
#define OS_SRC_GTMTOM11				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E34u))
#define OS_SRC_GTMTOM12				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E38u))
#define OS_SRC_GTMTOM13				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E3Cu))
#define OS_SRC_GTMTOM14				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E40u))
#define OS_SRC_GTMTOM15				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E44u))
#define OS_SRC_GTMTOM16				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E48u))
#define OS_SRC_GTMTOM17				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E4Cu))
#define OS_SRC_GTMTOM20				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E50u))
#define OS_SRC_GTMTOM21				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E54u))
#define OS_SRC_GTMTOM22				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E58u))
#define OS_SRC_GTMTOM23				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E5Cu))
#define OS_SRC_GTMTOM24				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E60u))
#define OS_SRC_GTMTOM25				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E64u))
#define OS_SRC_GTMTOM26				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E68u))
#define OS_SRC_GTMTOM27				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E6Cu))
#define OS_SRC_GTMTOM30				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E70u))
#define OS_SRC_GTMTOM31				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E74u))
#define OS_SRC_GTMTOM32				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E78u))
#define OS_SRC_GTMTOM33				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E7Cu))
#define OS_SRC_GTMTOM34				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E80u))
#define OS_SRC_GTMTOM35				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E84u))
#define OS_SRC_GTMTOM36				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E88u))
#define OS_SRC_GTMTOM37				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E8Cu))
#define OS_SRC_GTMTOM40				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E90u))
#define OS_SRC_GTMTOM41				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E94u))
#define OS_SRC_GTMTOM42				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E98u))
#define OS_SRC_GTMTOM43				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0E9Cu))
#define OS_SRC_GTMTOM44				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0EA0u))
#define OS_SRC_GTMTOM45				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0EA4u))
#define OS_SRC_GTMTOM46				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0EA8u))
#define OS_SRC_GTMTOM47				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0EACu))
/* 0x0EB0 to 0x0ECC are undocumented. */
#define OS_SRC_ASCLIN20TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0ED0u))
#define OS_SRC_ASCLIN20RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0ED4u))
#define OS_SRC_ASCLIN20ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0ED8u))
#define OS_SRC_ASCLIN21TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0EDCu))
#define OS_SRC_ASCLIN21RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0EE0u))
#define OS_SRC_ASCLIN21ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0EE4u))
/* 0x0EE8 to 0x0EEC are undocumented. */
#define OS_SRC_GTMATOM00			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0EF0u))
#define OS_SRC_GTMATOM01			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0EF4u))
#define OS_SRC_GTMATOM02			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0EF8u))
#define OS_SRC_GTMATOM03			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0EFCu))
#define OS_SRC_GTMATOM10			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F00u))
#define OS_SRC_GTMATOM11			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F04u))
#define OS_SRC_GTMATOM12			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F08u))
#define OS_SRC_GTMATOM13			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F0Cu))
#define OS_SRC_GTMATOM20			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F10u))
#define OS_SRC_GTMATOM21			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F14u))
#define OS_SRC_GTMATOM22			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F18u))
#define OS_SRC_GTMATOM23			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F1Cu))
#define OS_SRC_GTMATOM30			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F20u))
#define OS_SRC_GTMATOM31			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F24u))
#define OS_SRC_GTMATOM32			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F28u))
#define OS_SRC_GTMATOM33			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F2Cu))
#define OS_SRC_GTMATOM40			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F30u))
#define OS_SRC_GTMATOM41			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F34u))
#define OS_SRC_GTMATOM42			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F38u))
#define OS_SRC_GTMATOM43			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F3Cu))
#define OS_SRC_GTMATOM50			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F40u))
#define OS_SRC_GTMATOM51			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F44u))
#define OS_SRC_GTMATOM52			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F48u))
#define OS_SRC_GTMATOM53			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F4Cu))
#define OS_SRC_GTMATOM60			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F50u))
#define OS_SRC_GTMATOM61			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F54u))
#define OS_SRC_GTMATOM62			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F58u))
#define OS_SRC_GTMATOM63			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F5Cu))
#define OS_SRC_GTMATOM70			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F60u))
#define OS_SRC_GTMATOM71			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F64u))
#define OS_SRC_GTMATOM72			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F68u))
#define OS_SRC_GTMATOM73			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F6Cu))
#define OS_SRC_GTMATOM80			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F70u))
#define OS_SRC_GTMATOM81			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F74u))
#define OS_SRC_GTMATOM82			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F78u))
#define OS_SRC_GTMATOM83			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0F7Cu))
/* 0x0F80 to 0x0FAC are undocumented. */
#define OS_SRC_ASCLIN22TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FB0u))
#define OS_SRC_ASCLIN22RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FB4u))
#define OS_SRC_ASCLIN22ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FB8u))
#define OS_SRC_ASCLIN23TX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FBCu))
#define OS_SRC_ASCLIN23RX			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FC0u))
#define OS_SRC_ASCLIN23ERR			(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FC4u))
/* 0x0FC8 to 0x0FCC are undocumented. */
#define OS_SRC_GTMMCSW0				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FD0u))
#define OS_SRC_GTMMCSW1				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FD4u))
#define OS_SRC_GTMMCSW2				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FD8u))
#define OS_SRC_GTMMCSW3				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FDCu))
#define OS_SRC_GTMMCSW4				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FE0u))
#define OS_SRC_GTMMCSW5				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FE4u))
#define OS_SRC_GTMMCSW6				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FE8u))
#define OS_SRC_GTMMCSW7				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FECu))
#define OS_SRC_GTMMCSW8				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FF0u))
#define OS_SRC_GTMMCSW9				(*(os_tricoresrn_t *) (OS_SRCBASE + 0x0FF4u))

#endif /* OS_TC38X_H */

/* Editor settings; DO NOT DELETE
 * vi:set ts=4:
*/
